<h1>PDU</h1>

PDU (Protocol Data Unit) - это единица данных, которая испол
ьзуется в сетевых протоколах для передачи информации между у
стройствами в компьютерных сетях. PDU представляет собой стр
уктурированный блок данных, который содержит информацию о пе
редаваемых данных, а также метаданные, необходимые для их об
работки и доставки.

PDU может иметь различный размер и структуру в зависимости о
т конкретного сетевого протокола. В некоторых случаях PDU мо
жет включать в себя заголовки, которые содержат информацию о
маршрутизации, источнике, назначении и  другие параметры пер
едачи данных. В других случаях PDU может  представлять собой
просто блок данных, который передается между устройствами 
без  дополнительных   метаданных.

Примерами PDU могут  служить Ethernet-кадры в сети Ethernet,
IP-пакеты в сети TCP/IP, сегменты TCP в протоколе TCP и друг
ие. PDU является важной концепцией при работе с сетевыми про
токолами и сетевым оборудованием, так как он определяет стру
ктуру и формат данных, которые передаются в сети.


<h1>OSI</h1>


OSI (Open Systems Interconnection) - это сетевая модель, кот
орая описывает структуру и функции компьютерных сетей и сете
вых протоколов. Модель OSI была разработана Международной ор
ганизацией по  стандартизации (ISO) с целью стандартизации и
унификации коммуникаций между компьютерами и сетевыми устрой
ствами.
Модель OSI состоит из семи уровней, каждый из которых выполн
яет определенные функции и ответственен за определенные аспе
кты сетевой коммуникации. Вот краткое описание каждого уровн
я:
Физический уровень (Physical Layer): Этот уровень определяет
физические характеристики передачи  данных, такие  как среда
передачи (кабель, беспроводное соединение), метод модуляции,
напряжение и токи. Он отвечает  за передачу битов по среде п
ередачи.
Канальный уровень (Data Link Layer): Этот уровень обеспечива
ет управление доступом к среде передачи, обнаружение и испра
вление ошибок в данных, формирование кадров данных и адресац
ию              устройств                   в          сети.
Сетевой  уровень (Network Layer): На этом уровне выполняется
маршрутизация данных и управление трафиком в сети. Этот уров
ень использует IP-адресацию для идентификации устройств в се
ти.
Транспортный уровень (Transport Layer): Этот уровень обеспеч
ивает точечную коммуникацию между устройствами и управляет п
отоком данных. Примерами протоколов этого уровня являются TC
P (Transmission Control Protocol) и UDP (User Datagram Proto
col).
Сеансовый уровень (Session Layer): Этот уровень устанавливае
т, поддерживает и завершает сеансы связи между устройствами.
Он также отвечает за  управление сеансами и синхронизацию да
нных.
Представительский уровень (Presentation Layer): Этот уровень
обеспечивает   преобразование данных в формат, который может
быть понят и интерпретирован приложениями. Он также выполняе
т       сжатие          и          шифрование        данных.
Прикладной уровень (Application Layer): На этом уровне наход
ятся прикладные программы и сервисы, которые используют сеть
для  обмена данными. Примерами протоколов этого уровня являю
тся       HTTP,       FTP,          SMTP      и      другие.
Модель OSI помогает разработчикам и инженерам создавать сете
вые  протоколы и приложения, которые могут взаимодействовать
друг с другом независимо от аппаратных и программных платфор
м. Эта модель также используется для обучения и понимания ра
боты сетевых технологий.
